### CREATE A DATAFRAME FROM LIST

In [1]:
student_data = [['nidhi', 27], ['shreesha', 20],['ankita', 26], ['divya', 25]]

In [2]:
student_data

[['nidhi', 27], ['shreesha', 20], ['ankita', 26], ['divya', 25]]

In [3]:
import pandas as pd

In [4]:
student_age_df = pd.DataFrame(student_data, columns=['Name','Age'])

In [5]:
student_age_df

       Name  Age
0     nidhi   27
1  shreesha   20
2    ankita   26
3     divya   25

In [6]:
def create_dataframe(data_list):
    output = pd.DataFrame(data_list, columns = ['col_1', 'col_2'])
    return output

In [7]:
create_dataframe(student_data)

      col_1  col_2
0     nidhi     27
1  shreesha     20
2    ankita     26
3     divya     25